In [1]:
people = {
    "Name": ["Arsalan", "Farhan", "Adnan"],
    "Hobby": ["Coding", "Cycling", "Marketing"],
    "Email": ["arsalan1234@hotmail.com", "farhan124423@yahoo.com", "adnan23434@gmail.com"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

      Name      Hobby                    Email
0  Arsalan     Coding  arsalan1234@hotmail.com
1   Farhan    Cycling   farhan124423@yahoo.com
2    Adnan  Marketing     adnan23434@gmail.com

In [5]:
df.columns

Index(['Name', 'Hobby', 'Email'], dtype='object')

In [6]:
df.columns = ["First_Name", "Job", "Email"] # rename updated column names columns

In [7]:
df

  First_Name        Job                    Email
0    Arsalan     Coding  arsalan1234@hotmail.com
1     Farhan    Cycling   farhan124423@yahoo.com
2      Adnan  Marketing     adnan23434@gmail.com

In [8]:
df.columns = [x.upper() for x in df.columns] #making columns uppercase

In [9]:
df

  FIRST_NAME        JOB                    EMAIL
0    Arsalan     Coding  arsalan1234@hotmail.com
1     Farhan    Cycling   farhan124423@yahoo.com
2      Adnan  Marketing     adnan23434@gmail.com

In [10]:
df.columns = df.columns.str.replace(" ", "_") # replaces spaces with underscore

In [11]:
df

  FIRST_NAME        JOB                    EMAIL
0    Arsalan     Coding  arsalan1234@hotmail.com
1     Farhan    Cycling   farhan124423@yahoo.com
2      Adnan  Marketing     adnan23434@gmail.com

In [12]:
df.rename(columns={"FIRST_NAME": "NAME"}, inplace = True) # renamed one column previous applied to all columns

In [13]:
df

      NAME        JOB                    EMAIL
0  Arsalan     Coding  arsalan1234@hotmail.com
1   Farhan    Cycling   farhan124423@yahoo.com
2    Adnan  Marketing     adnan23434@gmail.com

In [14]:
df.loc[2, "NAME"] = "NomanEdited" #edited the name

In [15]:
df

          NAME        JOB                    EMAIL
0      Arsalan     Coding  arsalan1234@hotmail.com
1       Farhan    Cycling   farhan124423@yahoo.com
2  NomanEdited  Marketing     adnan23434@gmail.com

In [18]:
df.at[2, "NAME"] = "Adnan" # another way to edit the name

In [19]:
df

      NAME        JOB                    EMAIL
0  Arsalan     Coding  arsalan1234@hotmail.com
1   Farhan    Cycling   farhan124423@yahoo.com
2    Adnan  Marketing     adnan23434@gmail.com

In [29]:
df["EMAIL"] = df["EMAIL"].str.lower() # making contents of the column lower or upper case

In [30]:
df

      NAME        JOB                    EMAIL
0  Arsalan     Coding  arsalan1234@hotmail.com
1   Farhan    Cycling   farhan124423@yahoo.com
2    Adnan  Marketing     adnan23434@gmail.com

In [38]:
df["EMAIL"].apply(len) #apply function to edit data

0    23
1    22
2    20
Name: EMAIL, dtype: int64

In [39]:
def update_email(EMAIL):
    return EMAIL.upper()

In [40]:
df["EMAIL"].apply(update_email)

0    ARSALAN1234@HOTMAIL.COM
1     FARHAN124423@YAHOO.COM
2       ADNAN23434@GMAIL.COM
Name: EMAIL, dtype: object

In [44]:
df["EMAIL"] = df["EMAIL"].apply(lambda x: x.lower()) # editing it with anonymos function

In [45]:
df

      NAME        JOB                    EMAIL
0  Arsalan     Coding  arsalan1234@hotmail.com
1   Farhan    Cycling   farhan124423@yahoo.com
2    Adnan  Marketing     adnan23434@gmail.com